---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.ArrowLineWeight
source: html/e36c9296-ed22-c1b5-d890-639a73a73aa2.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.ArrowLineWeight Property

Line weight assigned to arrow lines for vectors.

## Syntax (C#)
```csharp
public int ArrowLineWeight { get; set; }
```